analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/usbhs_regs.h
#define MXC_F_USBHS_POWER_SUSPEND_POS                  1 /**< POWER_SUSPEND Position */
#define MXC_F_USBHS_POWER_SUSPEND                      ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_SUSPEND_POS)) /**< POWER_SUSPEND Mask */

#define MXC_F_USBHS_POWER_RESUME_POS                   2 /**< POWER_RESUME Position */
#define MXC_F_USBHS_POWER_RESUME                       ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_RESUME_POS)) /**< POWER_RESUME Mask */

#define MXC_F_USBHS_POWER_RESET_POS                    3 /**< POWER_RESET Position */
#define MXC_F_USBHS_POWER_RESET                        ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_RESET_POS)) /**< POWER_RESET Mask */

#define MXC_F_USBHS_POWER_HS_MODE_POS                  4 /**< POWER_HS_MODE Position */
#define MXC_F_USBHS_POWER_HS_MODE                      ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_HS_MODE_POS)) /**< POWER_HS_MODE Mask */

#define MXC_F_USBHS_POWER_HS_ENABLE_POS                5 /**< POWER_HS_ENABLE Position */
#define MXC_F_USBHS_POWER_HS_ENABLE                    ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_HS_ENABLE_POS)) /**< POWER_HS_ENABLE Mask */

#define MXC_F_USBHS_POWER_SOFTCONN_POS                 6 /**< POWER_SOFTCONN Position */
#define MXC_F_USBHS_POWER_SOFTCONN                     ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_SOFTCONN_POS)) /**< POWER_SOFTCONN Mask */

#define MXC_F_USBHS_POWER_ISO_UPDATE_POS               7 /**< POWER_ISO_UPDATE Position */
#define MXC_F_USBHS_POWER_ISO_UPDATE                   ((uint8_t)(0x1UL << MXC_F_USBHS_POWER_ISO_UPDATE_POS)) /**< POWER_ISO_UPDATE Mask */

/**@} end of group USBHS_POWER_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTRIN USBHS_INTRIN
 * @brief    Interrupt register for EP0 and IN EP1-15.
 * @{
 */
#define MXC_F_USBHS_INTRIN_EP15_IN_INT_POS             15 /**< INTRIN_EP15_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP15_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP15_IN_INT_POS)) /**< INTRIN_EP15_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP14_IN_INT_POS             14 /**< INTRIN_EP14_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP14_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP14_IN_INT_POS)) /**< INTRIN_EP14_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP13_IN_INT_POS             13 /**< INTRIN_EP13_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP13_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP13_IN_INT_POS)) /**< INTRIN_EP13_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP12_IN_INT_POS             12 /**< INTRIN_EP12_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP12_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP12_IN_INT_POS)) /**< INTRIN_EP12_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP11_IN_INT_POS             11 /**< INTRIN_EP11_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP11_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP11_IN_INT_POS)) /**< INTRIN_EP11_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP10_IN_INT_POS             10 /**< INTRIN_EP10_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP10_IN_INT                 ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP10_IN_INT_POS)) /**< INTRIN_EP10_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP9_IN_INT_POS              9 /**< INTRIN_EP9_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP9_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP9_IN_INT_POS)) /**< INTRIN_EP9_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP8_IN_INT_POS              8 /**< INTRIN_EP8_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP8_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP8_IN_INT_POS)) /**< INTRIN_EP8_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP7_IN_INT_POS              7 /**< INTRIN_EP7_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP7_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP7_IN_INT_POS)) /**< INTRIN_EP7_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP6_IN_INT_POS              6 /**< INTRIN_EP6_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP6_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP6_IN_INT_POS)) /**< INTRIN_EP6_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP5_IN_INT_POS              5 /**< INTRIN_EP5_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP5_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP5_IN_INT_POS)) /**< INTRIN_EP5_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP4_IN_INT_POS              4 /**< INTRIN_EP4_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP4_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP4_IN_INT_POS)) /**< INTRIN_EP4_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP3_IN_INT_POS              3 /**< INTRIN_EP3_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP3_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP3_IN_INT_POS)) /**< INTRIN_EP3_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP2_IN_INT_POS              2 /**< INTRIN_EP2_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP2_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP2_IN_INT_POS)) /**< INTRIN_EP2_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP1_IN_INT_POS              1 /**< INTRIN_EP1_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP1_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP1_IN_INT_POS)) /**< INTRIN_EP1_IN_INT Mask */

#define MXC_F_USBHS_INTRIN_EP0_IN_INT_POS              0 /**< INTRIN_EP0_IN_INT Position */
#define MXC_F_USBHS_INTRIN_EP0_IN_INT                  ((uint16_t)(0x1UL << MXC_F_USBHS_INTRIN_EP0_IN_INT_POS)) /**< INTRIN_EP0_IN_INT Mask */

/**@} end of group USBHS_INTRIN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTROUT USBHS_INTROUT
 * @brief    Interrupt register for OUT EP 1-15.
 * @{
 */
#define MXC_F_USBHS_INTROUT_EP15_OUT_INT_POS           15 /**< INTROUT_EP15_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP15_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP15_OUT_INT_POS)) /**< INTROUT_EP15_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP14_OUT_INT_POS           14 /**< INTROUT_EP14_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP14_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP14_OUT_INT_POS)) /**< INTROUT_EP14_OUT_INT Mask */

