analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/usbhs_regs.h
#define MXC_F_USBHS_INTROUT_EP13_OUT_INT_POS           13 /**< INTROUT_EP13_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP13_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP13_OUT_INT_POS)) /**< INTROUT_EP13_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP12_OUT_INT_POS           12 /**< INTROUT_EP12_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP12_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP12_OUT_INT_POS)) /**< INTROUT_EP12_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP11_OUT_INT_POS           11 /**< INTROUT_EP11_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP11_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP11_OUT_INT_POS)) /**< INTROUT_EP11_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP10_OUT_INT_POS           10 /**< INTROUT_EP10_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP10_OUT_INT               ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP10_OUT_INT_POS)) /**< INTROUT_EP10_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP9_OUT_INT_POS            9 /**< INTROUT_EP9_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP9_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP9_OUT_INT_POS)) /**< INTROUT_EP9_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP8_OUT_INT_POS            8 /**< INTROUT_EP8_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP8_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP8_OUT_INT_POS)) /**< INTROUT_EP8_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP7_OUT_INT_POS            7 /**< INTROUT_EP7_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP7_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP7_OUT_INT_POS)) /**< INTROUT_EP7_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP6_OUT_INT_POS            6 /**< INTROUT_EP6_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP6_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP6_OUT_INT_POS)) /**< INTROUT_EP6_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP5_OUT_INT_POS            5 /**< INTROUT_EP5_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP5_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP5_OUT_INT_POS)) /**< INTROUT_EP5_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP4_OUT_INT_POS            4 /**< INTROUT_EP4_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP4_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP4_OUT_INT_POS)) /**< INTROUT_EP4_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP3_OUT_INT_POS            3 /**< INTROUT_EP3_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP3_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP3_OUT_INT_POS)) /**< INTROUT_EP3_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP2_OUT_INT_POS            2 /**< INTROUT_EP2_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP2_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP2_OUT_INT_POS)) /**< INTROUT_EP2_OUT_INT Mask */

#define MXC_F_USBHS_INTROUT_EP1_OUT_INT_POS            1 /**< INTROUT_EP1_OUT_INT Position */
#define MXC_F_USBHS_INTROUT_EP1_OUT_INT                ((uint16_t)(0x1UL << MXC_F_USBHS_INTROUT_EP1_OUT_INT_POS)) /**< INTROUT_EP1_OUT_INT Mask */

/**@} end of group USBHS_INTROUT_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INTRINEN USBHS_INTRINEN
 * @brief    Interrupt enable for EP 0 and IN EP 1-15.
 * @{
 */
#define MXC_F_USBHS_INTRINEN_EP15_IN_INT_EN_POS        15 /**< INTRINEN_EP15_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP15_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP15_IN_INT_EN_POS)) /**< INTRINEN_EP15_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP14_IN_INT_EN_POS        14 /**< INTRINEN_EP14_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP14_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP14_IN_INT_EN_POS)) /**< INTRINEN_EP14_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP13_IN_INT_EN_POS        13 /**< INTRINEN_EP13_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP13_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP13_IN_INT_EN_POS)) /**< INTRINEN_EP13_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP12_IN_INT_EN_POS        12 /**< INTRINEN_EP12_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP12_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP12_IN_INT_EN_POS)) /**< INTRINEN_EP12_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP11_IN_INT_EN_POS        11 /**< INTRINEN_EP11_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP11_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP11_IN_INT_EN_POS)) /**< INTRINEN_EP11_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP10_IN_INT_EN_POS        10 /**< INTRINEN_EP10_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP10_IN_INT_EN            ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP10_IN_INT_EN_POS)) /**< INTRINEN_EP10_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP9_IN_INT_EN_POS         9 /**< INTRINEN_EP9_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP9_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP9_IN_INT_EN_POS)) /**< INTRINEN_EP9_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP8_IN_INT_EN_POS         8 /**< INTRINEN_EP8_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP8_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP8_IN_INT_EN_POS)) /**< INTRINEN_EP8_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP7_IN_INT_EN_POS         7 /**< INTRINEN_EP7_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP7_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP7_IN_INT_EN_POS)) /**< INTRINEN_EP7_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP6_IN_INT_EN_POS         6 /**< INTRINEN_EP6_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP6_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP6_IN_INT_EN_POS)) /**< INTRINEN_EP6_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP5_IN_INT_EN_POS         5 /**< INTRINEN_EP5_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP5_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP5_IN_INT_EN_POS)) /**< INTRINEN_EP5_IN_INT_EN Mask */

#define MXC_F_USBHS_INTRINEN_EP4_IN_INT_EN_POS         4 /**< INTRINEN_EP4_IN_INT_EN Position */
#define MXC_F_USBHS_INTRINEN_EP4_IN_INT_EN             ((uint16_t)(0x1UL << MXC_F_USBHS_INTRINEN_EP4_IN_INT_EN_POS)) /**< INTRINEN_EP4_IN_INT_EN Mask */

