analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/usbhs_regs.h
#define MXC_F_USBHS_INCSRL_SENTSTALL_POS               5 /**< INCSRL_SENTSTALL Position */
#define MXC_F_USBHS_INCSRL_SENTSTALL                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_SENTSTALL_POS)) /**< INCSRL_SENTSTALL Mask */

#define MXC_F_USBHS_INCSRL_SENDSTALL_POS               4 /**< INCSRL_SENDSTALL Position */
#define MXC_F_USBHS_INCSRL_SENDSTALL                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_SENDSTALL_POS)) /**< INCSRL_SENDSTALL Mask */

#define MXC_F_USBHS_INCSRL_FLUSHFIFO_POS               3 /**< INCSRL_FLUSHFIFO Position */
#define MXC_F_USBHS_INCSRL_FLUSHFIFO                   ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_FLUSHFIFO_POS)) /**< INCSRL_FLUSHFIFO Mask */

#define MXC_F_USBHS_INCSRL_UNDERRUN_POS                2 /**< INCSRL_UNDERRUN Position */
#define MXC_F_USBHS_INCSRL_UNDERRUN                    ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_UNDERRUN_POS)) /**< INCSRL_UNDERRUN Mask */

#define MXC_F_USBHS_INCSRL_FIFONOTEMPTY_POS            1 /**< INCSRL_FIFONOTEMPTY Position */
#define MXC_F_USBHS_INCSRL_FIFONOTEMPTY                ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_FIFONOTEMPTY_POS)) /**< INCSRL_FIFONOTEMPTY Mask */

#define MXC_F_USBHS_INCSRL_INPKTRDY_POS                0 /**< INCSRL_INPKTRDY Position */
#define MXC_F_USBHS_INCSRL_INPKTRDY                    ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_INPKTRDY_POS)) /**< INCSRL_INPKTRDY Mask */

/**@} end of group USBHS_INCSRL_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INCSRU USBHS_INCSRU
 * @brief    Control status upper register for INx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_INCSRU_AUTOSET_POS                 7 /**< INCSRU_AUTOSET Position */
#define MXC_F_USBHS_INCSRU_AUTOSET                     ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_AUTOSET_POS)) /**< INCSRU_AUTOSET Mask */

#define MXC_F_USBHS_INCSRU_ISO_POS                     6 /**< INCSRU_ISO Position */
#define MXC_F_USBHS_INCSRU_ISO                         ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_ISO_POS)) /**< INCSRU_ISO Mask */

#define MXC_F_USBHS_INCSRU_MODE_POS                    5 /**< INCSRU_MODE Position */
#define MXC_F_USBHS_INCSRU_MODE                        ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_MODE_POS)) /**< INCSRU_MODE Mask */

#define MXC_F_USBHS_INCSRU_FRCDATATOG_POS              3 /**< INCSRU_FRCDATATOG Position */
#define MXC_F_USBHS_INCSRU_FRCDATATOG                  ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_FRCDATATOG_POS)) /**< INCSRU_FRCDATATOG Mask */

#define MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS              1 /**< INCSRU_DPKTBUFDIS Position */
#define MXC_F_USBHS_INCSRU_DPKTBUFDIS                  ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRU_DPKTBUFDIS_POS)) /**< INCSRU_DPKTBUFDIS Mask */

/**@} end of group USBHS_INCSRU_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTMAXP USBHS_OUTMAXP
 * @brief    Maximum packet size for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1_POS          11 /**< OUTMAXP_NUMPACKMINUS1 Position */
#define MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1              ((uint16_t)(0x1FUL << MXC_F_USBHS_OUTMAXP_NUMPACKMINUS1_POS)) /**< OUTMAXP_NUMPACKMINUS1 Mask */

#define MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE_POS          0 /**< OUTMAXP_MAXPACKETSIZE Position */
#define MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE              ((uint16_t)(0x7FFUL << MXC_F_USBHS_OUTMAXP_MAXPACKETSIZE_POS)) /**< OUTMAXP_MAXPACKETSIZE Mask */

/**@} end of group USBHS_OUTMAXP_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCSRL USBHS_OUTCSRL
 * @brief    Control status lower register for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCSRL_CLRDATATOG_POS             7 /**< OUTCSRL_CLRDATATOG Position */
#define MXC_F_USBHS_OUTCSRL_CLRDATATOG                 ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_CLRDATATOG_POS)) /**< OUTCSRL_CLRDATATOG Mask */

#define MXC_F_USBHS_OUTCSRL_SENTSTALL_POS              6 /**< OUTCSRL_SENTSTALL Position */
#define MXC_F_USBHS_OUTCSRL_SENTSTALL                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_SENTSTALL_POS)) /**< OUTCSRL_SENTSTALL Mask */

#define MXC_F_USBHS_OUTCSRL_SENDSTALL_POS              5 /**< OUTCSRL_SENDSTALL Position */
#define MXC_F_USBHS_OUTCSRL_SENDSTALL                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_SENDSTALL_POS)) /**< OUTCSRL_SENDSTALL Mask */

#define MXC_F_USBHS_OUTCSRL_FLUSHFIFO_POS              4 /**< OUTCSRL_FLUSHFIFO Position */
#define MXC_F_USBHS_OUTCSRL_FLUSHFIFO                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_FLUSHFIFO_POS)) /**< OUTCSRL_FLUSHFIFO Mask */

#define MXC_F_USBHS_OUTCSRL_DATAERROR_POS              3 /**< OUTCSRL_DATAERROR Position */
#define MXC_F_USBHS_OUTCSRL_DATAERROR                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_DATAERROR_POS)) /**< OUTCSRL_DATAERROR Mask */

#define MXC_F_USBHS_OUTCSRL_OVERRUN_POS                2 /**< OUTCSRL_OVERRUN Position */
#define MXC_F_USBHS_OUTCSRL_OVERRUN                    ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_OVERRUN_POS)) /**< OUTCSRL_OVERRUN Mask */

#define MXC_F_USBHS_OUTCSRL_FIFOFULL_POS               1 /**< OUTCSRL_FIFOFULL Position */
#define MXC_F_USBHS_OUTCSRL_FIFOFULL                   ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_FIFOFULL_POS)) /**< OUTCSRL_FIFOFULL Mask */

#define MXC_F_USBHS_OUTCSRL_OUTPKTRDY_POS              0 /**< OUTCSRL_OUTPKTRDY Position */
#define MXC_F_USBHS_OUTCSRL_OUTPKTRDY                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRL_OUTPKTRDY_POS)) /**< OUTCSRL_OUTPKTRDY Mask */

/**@} end of group USBHS_OUTCSRL_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCSRU USBHS_OUTCSRU
 * @brief    Control status upper register for OUTx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCSRU_AUTOCLEAR_POS              7 /**< OUTCSRU_AUTOCLEAR Position */
#define MXC_F_USBHS_OUTCSRU_AUTOCLEAR                  ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_AUTOCLEAR_POS)) /**< OUTCSRU_AUTOCLEAR Mask */

#define MXC_F_USBHS_OUTCSRU_ISO_POS                    6 /**< OUTCSRU_ISO Position */
#define MXC_F_USBHS_OUTCSRU_ISO                        ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_ISO_POS)) /**< OUTCSRU_ISO Mask */

#define MXC_F_USBHS_OUTCSRU_DISNYET_POS                4 /**< OUTCSRU_DISNYET Position */
#define MXC_F_USBHS_OUTCSRU_DISNYET                    ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_DISNYET_POS)) /**< OUTCSRU_DISNYET Mask */

